/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
LOAD 'postgraph';
SET search_path TO postgraph;
CREATE GRAPH cypher_set;
NOTICE:  graph "cypher_set" has been created
 create_graph 
--------------
 
(1 row)

USE GRAPH cypher_set;
 use_graph 
-----------
 
(1 row)

CREATE (:v);
--
(0 rows)

CREATE (:v {i: 0, j: 5, a: 0});
--
(0 rows)

CREATE (:v {i: 1});
--
(0 rows)

--Simple SET test case
MATCH (n) SET n.i = 3;
--
(0 rows)

MATCH (n) WHERE n.j = 5 SET n.i = NULL RETURN n;
                                   n                                   
-----------------------------------------------------------------------
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "j": 5}}
(1 row)

MATCH (n) RETURN n;
                                   n                                   
-----------------------------------------------------------------------
 {"id": 844424930131969, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131971, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "j": 5}}
(3 rows)

MATCH (n) SET n.i = NULL RETURN n;
                                   n                                   
-----------------------------------------------------------------------
 {"id": 844424930131969, "label": "v", "properties": {}}
 {"id": 844424930131971, "label": "v", "properties": {}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "j": 5}}
(3 rows)

MATCH (n) RETURN n;
                                   n                                   
-----------------------------------------------------------------------
 {"id": 844424930131969, "label": "v", "properties": {}}
 {"id": 844424930131971, "label": "v", "properties": {}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "j": 5}}
(3 rows)

MATCH (n) SET n.i = 3 RETURN n;
                                       n                                       
-------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131971, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 3, "j": 5}}
(3 rows)

MATCH (n) RETURN n;
                                       n                                       
-------------------------------------------------------------------------------
 {"id": 844424930131969, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131971, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 3, "j": 5}}
(3 rows)

--Handle Inheritance
CREATE ();
--
(0 rows)

MATCH (n) SET n.i = 3 RETURN n;
                                       n                                       
-------------------------------------------------------------------------------
 {"id": 281474976710657, "label": "", "properties": {"i": 3}}
 {"id": 844424930131969, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131971, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 3, "j": 5}}
(4 rows)

MATCH (n) RETURN n;
                                       n                                       
-------------------------------------------------------------------------------
 {"id": 281474976710657, "label": "", "properties": {"i": 3}}
 {"id": 844424930131969, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131971, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 3, "j": 5}}
(4 rows)

--Validate Paths are updated
MATCH (n) CREATE (n)-[:e {j:20}]->(:other_v {k:10}) RETURN n;
                                       n                                       
-------------------------------------------------------------------------------
 {"id": 281474976710657, "label": "", "properties": {"i": 3}}
 {"id": 844424930131969, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131971, "label": "v", "properties": {"i": 3}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 3, "j": 5}}
(4 rows)

MATCH p=(n)-[]->() SET n.i = 50 RETURN p;
                                                                                                                                        p                                                                                                                                         
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 281474976710657, "label": "", "properties": {"i": 3}}, {"id": 1125899906842625, "start_id": 281474976710657, "end_id": 1407374883553281, "label": "e", "properties": {"j": 20}}, {"id": 1407374883553281, "label": "other_v", "properties": {"k": 10}}]
 [{"id": 844424930131969, "label": "v", "properties": {"i": 3}}, {"id": 1125899906842626, "start_id": 844424930131969, "end_id": 1407374883553282, "label": "e", "properties": {"j": 20}}, {"id": 1407374883553282, "label": "other_v", "properties": {"k": 10}}]
 [{"id": 844424930131971, "label": "v", "properties": {"i": 3}}, {"id": 1125899906842627, "start_id": 844424930131971, "end_id": 1407374883553283, "label": "e", "properties": {"j": 20}}, {"id": 1407374883553283, "label": "other_v", "properties": {"k": 10}}]
 [{"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 3, "j": 5}}, {"id": 1125899906842628, "start_id": 844424930131970, "end_id": 1407374883553284, "label": "e", "properties": {"j": 20}}, {"id": 1407374883553284, "label": "other_v", "properties": {"k": 10}}]
(4 rows)

--Edges
MATCH ()-[n]-(:other_v) SET n.i = 3 RETURN n;
                                                                n                                                                 
----------------------------------------------------------------------------------------------------------------------------------
 {"id": 1125899906842625, "start_id": 281474976710657, "end_id": 1407374883553281, "label": "e", "properties": {"i": 3, "j": 20}}
 {"id": 1125899906842626, "start_id": 844424930131969, "end_id": 1407374883553282, "label": "e", "properties": {"i": 3, "j": 20}}
 {"id": 1125899906842627, "start_id": 844424930131971, "end_id": 1407374883553283, "label": "e", "properties": {"i": 3, "j": 20}}
 {"id": 1125899906842628, "start_id": 844424930131970, "end_id": 1407374883553284, "label": "e", "properties": {"i": 3, "j": 20}}
(4 rows)

MATCH ()-[n]->(:other_v) RETURN n;
ERROR:  operator does not exist: label_id postgraph.= integer
HINT:  No operator matches the given name and argument types. You might need to add explicit type casts.
MATCH (n {j: 5}) SET n.y = 50 SET n.z = 99 RETURN n;
                                                n                                                 
--------------------------------------------------------------------------------------------------
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "y": 50, "z": 99}}
(1 row)

MATCH (n {j: 5}) RETURN n;
                                                n                                                 
--------------------------------------------------------------------------------------------------
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "y": 50, "z": 99}}
(1 row)

--Create a loop and see that set can work after create
MATCH (n {j: 5}) CREATE p=(n)-[e:e {j:34}]->(n) SET n.y = 99 RETURN n, p;
                                                n                                                 |                                                                                                                                                               p                                                                                                                                                               
--------------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "y": 99, "z": 99}} | [{"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "y": 50, "z": 99}}, {"id": 1125899906842629, "start_id": 844424930131970, "end_id": 844424930131970, "label": "e", "properties": {"j": 34}}, {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "y": 50, "z": 99}}]
(1 row)

--Create a loop and see that set can work after create
CREATE ()-[e:e {j:34}]->() SET e.y = 99 RETURN e;
                                                                e                                                                 
----------------------------------------------------------------------------------------------------------------------------------
 {"id": 1125899906842630, "start_id": 281474976710658, "end_id": 281474976710659, "label": "e", "properties": {"j": 34, "y": 99}}
(1 row)

MATCH (n) MATCH (n)-[e:e {j:34}]->() SET n.y = 1 RETURN n;
                                                n                                                
-------------------------------------------------------------------------------------------------
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "y": 1, "z": 99}}
 {"id": 281474976710658, "label": "", "properties": {"y": 1}}
(2 rows)

MATCH (n) MATCH ()-[e:e {j:34}]->(n) SET n.y = 2 RETURN n;
                                                n                                                
-------------------------------------------------------------------------------------------------
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "y": 2, "z": 99}}
 {"id": 281474976710659, "label": "", "properties": {"y": 2}}
(2 rows)

MATCH (n)-[]->(n) SET n.y = 99 RETURN n;
                                                n                                                 
--------------------------------------------------------------------------------------------------
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "y": 99, "z": 99}}
(1 row)

MATCH (n) MATCH (n)-[]->(m) SET n.t = 150 RETURN n;
                                                     n                                                      
------------------------------------------------------------------------------------------------------------
 {"id": 281474976710658, "label": "", "properties": {"t": 150, "y": 1}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 281474976710657, "label": "", "properties": {"i": 50, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": 50, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": 50, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 50, "j": 5, "t": 150, "y": 99, "z": 99}}
(6 rows)

-- prepared statements
/*
PREPARE p_1 AS MATCH (n) SET n.i = 3 RETURN n ;
EXECUTE p_1;

EXECUTE p_1;

PREPARE p_2 AS MATCH (n) SET n.i = $var_name RETURN n ;
EXECUTE p_2('{"var_name": 4}');

EXECUTE p_2('{"var_name": 6}');

CREATE FUNCTION set_test()
RETURNS TABLE(vertex vertex)
LANGUAGE plpgsql
VOLATILE
AS $BODY$
BEGIN
	RETURN QUERY MATCH (n) SET n.i = 7 RETURN n ;
END
$BODY$;

SELECT set_test();

SELECT set_test();
*/
--
-- Updating multiple fieds
--
MATCH (n) SET n.i = 3, n.j = 5 RETURN n ;
                                                     n                                                     
-----------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": 3, "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": 3, "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": 3, "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": 3, "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": 3, "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 3, "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": 3, "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": 3, "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": 3, "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": 3, "j": 5, "k": 10}}
(10 rows)

MATCH (n)-[m]->(n) SET m.y = n.y RETURN n, m;
                                                     n                                                     |                                                                m                                                                 
-----------------------------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": 3, "j": 5, "t": 150, "y": 99, "z": 99}} | {"id": 1125899906842629, "start_id": 844424930131970, "end_id": 844424930131970, "label": "e", "properties": {"j": 34, "y": 99}}
(1 row)

--Errors
SET n.i = NULL;
ERROR:  syntax error at or near "NULL"
LINE 1: SET n.i = NULL;
                  ^
MATCH (n) SET wrong_var.i = 3;
ERROR:  undefined reference to variable wrong_var in SET clause
LINE 1: MATCH (n) SET wrong_var.i = 3;
                      ^
MATCH (n) SET i = 3;
ERROR:  undefined reference to variable i in SET clause
LINE 1: MATCH (n) SET i = 3;
                      ^
--
-- SET refactor regression tests
--
-- INSERT INTO
/*
CREATE TABLE tbl (result vertex);


MATCH (u:vertices) return u ;
MATCH (u:begin)-[:edge]->(v:end) return u, v ;

INSERT INTO tbl (MATCH (u:vertices) SET u.i = 7 return u ;
INSERT INTO tbl (MATCH (u:vertices) SET u.i = 13 return u ;

SELECT * FROM tbl;
*/
CREATE (u:vertices) ;
--
(0 rows)

CREATE (u:begin)-[:edge]->(v:end) ;
--
(0 rows)

MATCH (u:vertices) return u ;
                                u                                
-----------------------------------------------------------------
 {"id": 1688849860263937, "label": "vertices", "properties": {}}
(1 row)

BEGIN;
MATCH (u:vertices) SET u.i = 1, u.j = 3, u.k = 5 return u ;
                                           u                                           
---------------------------------------------------------------------------------------
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": 1, "j": 3, "k": 5}}
(1 row)

MATCH (u:vertices) return u ;
                                           u                                           
---------------------------------------------------------------------------------------
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": 1, "j": 3, "k": 5}}
(1 row)

MATCH (u:vertices) SET u.i = 2, u.j = 4, u.k = 6 return u ;
                                           u                                           
---------------------------------------------------------------------------------------
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": 2, "j": 4, "k": 6}}
(1 row)

MATCH (u:vertices) return u ;
                                           u                                           
---------------------------------------------------------------------------------------
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": 2, "j": 4, "k": 6}}
(1 row)

MATCH (u:vertices) SET u.i = 3, u.j = 6, u.k = 9 return u ;
                                           u                                           
---------------------------------------------------------------------------------------
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": 3, "j": 6, "k": 9}}
(1 row)

MATCH (u:vertices) return u ;
                                           u                                           
---------------------------------------------------------------------------------------
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": 3, "j": 6, "k": 9}}
(1 row)

MATCH (u:begin)-[:edge]->(v:end) SET u.i = 1, v.i = 2, u.j = 3, v.j = 4 return u, v ;
                                     u                                      |                                    v                                     
----------------------------------------------------------------------------+--------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": 1, "j": 3}} | {"id": 2533274790395905, "label": "end", "properties": {"i": 2, "j": 4}}
(1 row)

MATCH (u:begin)-[:edge]->(v:end) return u, v ;
                                     u                                      |                                    v                                     
----------------------------------------------------------------------------+--------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": 1, "j": 3}} | {"id": 2533274790395905, "label": "end", "properties": {"i": 2, "j": 4}}
(1 row)

MATCH (u:begin)-[:edge]->(v:end) SET u.i = 2, v.i = 1, u.j = 4, v.j = 3 return u, v ;
                                     u                                      |                                    v                                     
----------------------------------------------------------------------------+--------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": 2, "j": 4}} | {"id": 2533274790395905, "label": "end", "properties": {"i": 1, "j": 3}}
(1 row)

MATCH (u:begin)-[:edge]->(v:end) return u, v ;
                                     u                                      |                                    v                                     
----------------------------------------------------------------------------+--------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": 2, "j": 4}} | {"id": 2533274790395905, "label": "end", "properties": {"i": 1, "j": 3}}
(1 row)

END;
MATCH (u:vertices) return u ;
                                           u                                           
---------------------------------------------------------------------------------------
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": 3, "j": 6, "k": 9}}
(1 row)

MATCH (u:begin)-[:edge]->(v:end) return u, v ;
                                     u                                      |                                    v                                     
----------------------------------------------------------------------------+--------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": 2, "j": 4}} | {"id": 2533274790395905, "label": "end", "properties": {"i": 1, "j": 3}}
(1 row)

-- test lists
MATCH (n) SET n.i = [3, 'test', [1, 2, 3], {id: 1}, 1.0, 1.0::numeric] RETURN n;
                                                                             n                                                                              
------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "k": 10}}
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 6, "k": 9}}
 {"id": 1970324836974593, "label": "begin", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 4}}
 {"id": 2533274790395905, "label": "end", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 3}}
(13 rows)

MATCH (n) RETURN n;
                                                                             n                                                                              
------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 5, "k": 10}}
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 6, "k": 9}}
 {"id": 1970324836974593, "label": "begin", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 4}}
 {"id": 2533274790395905, "label": "end", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 3}}
(13 rows)

-- test that lists get updated in paths
MATCH p=(u:begin)-[:edge]->(v:end) SET u.i = [1, 2, 3] return u, p ;
                                         u                                          |                                                                                                                                                                                        p                                                                                                                                                                                        
------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": [1, 2, 3], "j": 4}} | [{"id": 1970324836974593, "label": "begin", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 4}}, {"id": 2251799813685249, "start_id": 1970324836974593, "end_id": 2533274790395905, "label": "edge", "properties": {}}, {"id": 2533274790395905, "label": "end", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 3}}]
(1 row)

MATCH p=(u:begin)-[:edge]->(v:end) return u, p ;
                                         u                                          |                                                                                                                                                                   p                                                                                                                                                                    
------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": [1, 2, 3], "j": 4}} | [{"id": 1970324836974593, "label": "begin", "properties": {"i": [1, 2, 3], "j": 4}}, {"id": 2251799813685249, "start_id": 1970324836974593, "end_id": 2533274790395905, "label": "edge", "properties": {}}, {"id": 2533274790395905, "label": "end", "properties": {"i": [3, "test", [1, 2, 3], {"id": 1}, 1.0, 1::numeric], "j": 3}}]
(1 row)

-- test empty lists
MATCH (n) SET n.i = [] RETURN n;
                                                     n                                                      
------------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": [], "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": [], "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": [], "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": [], "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": [], "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": [], "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": [], "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": [], "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": [], "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": [], "j": 5, "k": 10}}
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": [], "j": 6, "k": 9}}
 {"id": 1970324836974593, "label": "begin", "properties": {"i": [], "j": 4}}
 {"id": 2533274790395905, "label": "end", "properties": {"i": [], "j": 3}}
(13 rows)

MATCH (n) RETURN n;
                                                     n                                                      
------------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": [], "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": [], "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": [], "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": [], "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": [], "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": [], "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": [], "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": [], "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": [], "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": [], "j": 5, "k": 10}}
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": [], "j": 6, "k": 9}}
 {"id": 1970324836974593, "label": "begin", "properties": {"i": [], "j": 4}}
 {"id": 2533274790395905, "label": "end", "properties": {"i": [], "j": 3}}
(13 rows)

-- test maps
MATCH (n) SET n.i = {prop1: 3, prop2:'test', prop3: [1, 2, 3], prop4: {id: 1}, prop5: 1.0, prop6:1.0::numeric} RETURN n;
                                                                                                        n                                                                                                         
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "k": 10}}
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 6, "k": 9}}
 {"id": 1970324836974593, "label": "begin", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 4}}
 {"id": 2533274790395905, "label": "end", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 3}}
(13 rows)

MATCH (n) RETURN n;
                                                                                                        n                                                                                                         
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 5, "k": 10}}
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 6, "k": 9}}
 {"id": 1970324836974593, "label": "begin", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 4}}
 {"id": 2533274790395905, "label": "end", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 3}}
(13 rows)

-- test maps in paths
MATCH p=(u:begin)-[:edge]->(v:end) SET u.i = {prop1: 1, prop2: 2, prop3: 3} return u, p ;
                                                       u                                                       |                                                                                                                                                                                                                                              p                                                                                                                                                                                                                                              
---------------------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": {"prop1": 1, "prop2": 2, "prop3": 3}, "j": 4}} | [{"id": 1970324836974593, "label": "begin", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 4}}, {"id": 2251799813685249, "start_id": 1970324836974593, "end_id": 2533274790395905, "label": "edge", "properties": {}}, {"id": 2533274790395905, "label": "end", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 3}}]
(1 row)

MATCH p=(u:begin)-[:edge]->(v:end) return u, p ;
                                                       u                                                       |                                                                                                                                                                                                            p                                                                                                                                                                                                            
---------------------------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 1970324836974593, "label": "begin", "properties": {"i": {"prop1": 1, "prop2": 2, "prop3": 3}, "j": 4}} | [{"id": 1970324836974593, "label": "begin", "properties": {"i": {"prop1": 1, "prop2": 2, "prop3": 3}, "j": 4}}, {"id": 2251799813685249, "start_id": 1970324836974593, "end_id": 2533274790395905, "label": "edge", "properties": {}}, {"id": 2533274790395905, "label": "end", "properties": {"i": {"prop1": 3, "prop2": "test", "prop3": [1, 2, 3], "prop4": {"id": 1}, "prop5": 1.0, "prop6": 1::numeric}, "j": 3}}]
(1 row)

-- test empty maps
MATCH (n) SET n.i = {} RETURN n;
                                                     n                                                      
------------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": {}, "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": {}, "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": {}, "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": {}, "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": {}, "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": {}, "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": {}, "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": {}, "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": {}, "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": {}, "j": 5, "k": 10}}
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": {}, "j": 6, "k": 9}}
 {"id": 1970324836974593, "label": "begin", "properties": {"i": {}, "j": 4}}
 {"id": 2533274790395905, "label": "end", "properties": {"i": {}, "j": 3}}
(13 rows)

MATCH (n) RETURN n;
                                                     n                                                      
------------------------------------------------------------------------------------------------------------
 {"id": 281474976710659, "label": "", "properties": {"i": {}, "j": 5, "y": 2}}
 {"id": 281474976710658, "label": "", "properties": {"i": {}, "j": 5, "t": 150, "y": 1}}
 {"id": 281474976710657, "label": "", "properties": {"i": {}, "j": 5, "t": 150}}
 {"id": 844424930131969, "label": "v", "properties": {"i": {}, "j": 5, "t": 150}}
 {"id": 844424930131971, "label": "v", "properties": {"i": {}, "j": 5, "t": 150}}
 {"id": 844424930131970, "label": "v", "properties": {"a": 0, "i": {}, "j": 5, "t": 150, "y": 99, "z": 99}}
 {"id": 1407374883553281, "label": "other_v", "properties": {"i": {}, "j": 5, "k": 10}}
 {"id": 1407374883553282, "label": "other_v", "properties": {"i": {}, "j": 5, "k": 10}}
 {"id": 1407374883553283, "label": "other_v", "properties": {"i": {}, "j": 5, "k": 10}}
 {"id": 1407374883553284, "label": "other_v", "properties": {"i": {}, "j": 5, "k": 10}}
 {"id": 1688849860263937, "label": "vertices", "properties": {"i": {}, "j": 6, "k": 9}}
 {"id": 1970324836974593, "label": "begin", "properties": {"i": {}, "j": 4}}
 {"id": 2533274790395905, "label": "end", "properties": {"i": {}, "j": 3}}
(13 rows)

--
-- Clean up
--
DROP TABLE tbl;
ERROR:  table "tbl" does not exist
DROP FUNCTION set_test;
ERROR:  could not find a function named "set_test"
DROP GRAPH cypher_set CASCADE;
NOTICE:  drop cascades to 9 other objects
DETAIL:  drop cascades to table cypher_set._ag_label_vertex
drop cascades to table cypher_set._ag_label_edge
drop cascades to table cypher_set.v
drop cascades to table cypher_set.e
drop cascades to table cypher_set.other_v
drop cascades to table cypher_set.vertices
drop cascades to table cypher_set.begin
drop cascades to table cypher_set.edge
drop cascades to table cypher_set."end"
NOTICE:  graph "cypher_set" has been dropped
 drop_graph 
------------
 
(1 row)

