/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
LOAD 'postgraph';
SET search_path TO postgraph;
SELECT create_graph('cypher_vle');
NOTICE:  graph "cypher_vle" has been created
 create_graph 
--------------
 
(1 row)

--
-- Create table to hold the start and end vertices to test the SRF
--
CREATE TABLE start_and_end_points (start_vertex vertex, end_vertex vertex);
-- Create a graph to test
SELECT * FROM cypher('cypher_vle', $$
	CREATE (b:begin)-[:edge {name: 'main edge'}]->(u1:middle)-[:edge {name: 'main edge'}]->(u2:middle)-[:edge {name: 'main edge'}]->(u3:middle)-[:edge {name: 'main edge'}]->(e:end),
	(u1)-[:self_loop {name: 'self loop'}]->(u1),
	(e)-[:self_loop {name: 'self loop'}]->(e),
	(b)-[:alternate_edge {name: 'alternate edge'}]->(u1),
	(u2)-[:alternate_edge {name: 'alternate edge'}]->(u3),
	(u3)-[:alternate_edge {name: 'alternate edge'}]->(e),
	(u2)-[:bypass_edge {name: 'bypass edge'}]->(e),
	(e)-[:alternate_edge {name: 'backup edge'}]->(u3), 
	(u3)-[:alternate_edge {name: 'backup edge'}]->(u2),
	(u2)-[:bypass_edge {name: 'bypass edge'}]->(b)
	RETURN b, e
$$) AS (b vertex, e vertex);
                              b                              |                             e                              
-------------------------------------------------------------+------------------------------------------------------------
 {"id": 844424930131969, "label": "begin", "properties": {}} | {"id": 1688849860263937, "label": "end", "properties": {}}
(1 row)

-- Insert start and end points for graph
INSERT INTO start_and_end_points (SELECT * FROM cypher('cypher_vle', $$MATCH (b:begin)-[:edge]->()-[:edge]->()-[:edge]->()-[:edge]->(e:end) RETURN b, e $$) AS (b vertex, e vertex));
-- Display our points
SELECT * FROM start_and_end_points;
                        start_vertex                         |                         end_vertex                         
-------------------------------------------------------------+------------------------------------------------------------
 {"id": 844424930131969, "label": "begin", "properties": {}} | {"id": 1688849860263937, "label": "end", "properties": {}}
(1 row)

SELECT edges
FROM start_and_end_points,
     age_vle(
	'"cypher_vle"'::gtype,
	start_vertex, end_vertex,
	'{"id": 1, "label": "", "end_id": 2, "start_id": 3, "properties": {}}::edge'::gtype,
	'3'::gtype,
	'3'::gtype,
	'-1'::gtype);
                                                                                                                                                                                                                                                                                            edges                                                                                                                                                                                                                                                                                             
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}]
(1 row)

-- Count the total paths from left (start) to right (end) -[]-> should be 400
SELECT count(edges) FROM start_and_end_points, age_vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '{"id": 1, "label": "", "end_id": 2, "start_id": 3, "properties": {}}::edge'::gtype, '1'::gtype, 'null'::gtype, '1'::gtype) group by ctid;
 count 
-------
   400
(1 row)

-- Count the total paths from right (end) to left (start) <-[]- should be 2
SELECT count(edges) FROM start_and_end_points, age_vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '{"id": 1, "label": "", "end_id": 2, "start_id": 3, "properties": {}}::edge'::gtype, '1'::gtype, 'null'::gtype, '-1'::gtype) group by ctid;
 count 
-------
     2
(1 row)

-- Count the total paths undirectional -[]- should be 7092
SELECT count(edges) FROM start_and_end_points, age_vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '{"id": 1, "label": "", "end_id": 2, "start_id": 3, "properties": {}}::edge'::gtype, '1'::gtype, 'null'::gtype, '0'::gtype) group by ctid;
 count 
-------
  7092
(1 row)

-- All paths of length 3 -[]-> should be 2
SELECT count(edges) FROM start_and_end_points, age_vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '{"id": 1, "label": "", "end_id": 2, "start_id": 3, "properties": {}}::edge'::gtype, '3'::gtype, '3'::gtype, '1'::gtype);
 count 
-------
     2
(1 row)

-- All paths of length 3 <-[]- should be 1
SELECT count(edges) FROM start_and_end_points, age_vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '{"id": 1, "label": "", "end_id": 2, "start_id": 3, "properties": {}}::edge'::gtype, '3'::gtype, '3'::gtype, '-1'::gtype);
 count 
-------
     1
(1 row)

-- All paths of length 3 -[]- should be 12
SELECT count(edges) FROM start_and_end_points, age_vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '{"id": 1, "label": "", "end_id": 2, "start_id": 3, "properties": {}}::edge'::gtype, '3'::gtype, '3'::gtype, '0'::gtype);
 count 
-------
    12
(1 row)

-- Test edge label matching - should match 1
SELECT count(edges) FROM start_and_end_points, age_vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '{"id": 1, "label": "edge", "end_id": 2, "start_id": 3, "properties": {}}::edge'::gtype, '1'::gtype, 'null'::gtype, '1'::gtype);
 count 
-------
     1
(1 row)

-- Test scalar property matching - should match 1
SELECT count(edges) FROM start_and_end_points, age_vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '{"id": 1, "label": "", "end_id": 2, "start_id": 3, "properties": {"name": "main edge"}}::edge'::gtype, '1'::gtype, 'null'::gtype, '1'::gtype);
 count 
-------
     1
(1 row)

-- Test the VLE match integration
-- Each should find 400
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*..]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*0..]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*1..]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*1..200]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

-- Each should find 2
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*..]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*0..]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*1..]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*1..200]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

-- Each should find 7092
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*..]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*0..]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*1..]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*1..200]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

-- Each should find 1
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[:edge*]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[:edge* {name: "main edge"}]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[* {name: "main edge"}]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

-- Each should find 1
SELECT * FROM cypher('cypher_vle', $$MATCH ()<-[*4..4 {name: "main edge"}]-() RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u)<-[*4..4 {name: "main edge"}]-() RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH ()<-[*4..4 {name: "main edge"}]-(v) RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

-- Each should find 2922
SELECT * FROM cypher('cypher_vle', $$MATCH ()-[*]->() RETURN count(*) $$) AS (e gtype);
  e   
------
 2922
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u)-[*]->() RETURN count(*) $$) AS (e gtype);
  e   
------
 2922
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH ()-[*]->(v) RETURN count(*) $$) AS (e gtype);
  e   
------
 2922
(1 row)

-- Should find 2
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[e*]-(v:end) RETURN e $$) AS (e variable_edge);
                                                                                                                                                                                                                                                                                                                                                                                                    e                                                                                                                                                                                                                                                                                                                                                                                                    
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}]
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}]
(2 rows)

-- Should find 5
SELECT * FROM cypher('cypher_vle', $$MATCH p=(:begin)<-[*1..1]-()-[]-() RETURN p ORDER BY p $$) AS (e traversal);
ERROR:  could not identify an ordering operator for type traversal
LINE 1: ...CH p=(:begin)<-[*1..1]-()-[]-() RETURN p ORDER BY p $$) AS (...
                                                             ^
HINT:  Use an explicit ordering operator or modify the query.
-- Should find 2922
SELECT * FROM cypher('cypher_vle', $$MATCH p=()-[*]->(v) RETURN count(*) $$) AS (e gtype);
  e   
------
 2922
(1 row)

-- Should find 2
SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)-[*3..3]->(v:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                      e                                                                                                                                                                                                                                                                                                                                                       
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2251799813685249, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 1125899906842628, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(2 rows)

-- Should find 12
SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)-[*3..3]-(v:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                              e                                                                                                                                                                                                                                                                                                                                                              
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685251, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 1125899906842625, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685250, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685250, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685251, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685250, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 1125899906842625, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842626, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842626, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685251, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842626, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 1125899906842625, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2251799813685249, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 1125899906842628, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(12 rows)

-- Each should find 2
SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)<-[*]-(v:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                                                                                                                                e                                                                                                                                                                                                                                                                                                                                                                                                                                                                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(2 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)<-[e*]-(v:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                                                                                                                                e                                                                                                                                                                                                                                                                                                                                                                                                                                                                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(2 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)<-[e*]-(v:end) RETURN e $$) AS (e variable_edge);
                                                                                                                                                                                                                                                                                                                                                                                                    e                                                                                                                                                                                                                                                                                                                                                                                                    
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}]
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}]
(2 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(:begin)<-[*]-()<-[]-(:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                                                                                                                                e                                                                                                                                                                                                                                                                                                                                                                                                                                                                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(2 rows)

-- Each should return 31
SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1]->(v)-[e2]->() RETURN e1,e2 $$) AS (e1 edge, e2 edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1*1..1]->(v)-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 variable_edge, e2 variable_edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH (v)-[e1*1..1]->()-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 variable_edge, e2 variable_edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1]->(v)-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 edge, e2 variable_edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1]->()-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 edge, e2 variable_edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1*1..1]->(v)-[e2]->() RETURN e1, e2
$$) AS (e1 variable_edge, e2 edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1*1..1]->()-[e2]->() RETURN e1, e2 $$) AS (e1 variable_edge, e2 edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH (a)-[e1]->(a)-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 edge, e2 variable_edge);
 count 
-------
     2
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH (a) MATCH (a)-[e1*1..1]->(v) RETURN e1 $$) AS (e1 variable_edge);
 count 
-------
    13
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH (a) MATCH ()-[e1*1..1]->(a) RETURN e1 $$) AS (e1 variable_edge);
 count 
-------
    13
(1 row)

SELECT count(*)
FROM cypher('cypher_vle', $$
    MATCH (a)-[e*1..1]->()
    RETURN a, e
$$) AS (e1 vertex, e2 variable_edge);
 count 
-------
    13
(1 row)

-- Should return 1 path
SELECT * FROM cypher('cypher_vle', $$ MATCH p=()<-[e1*]-(:end)-[e2*]->(:begin) RETURN p $$) AS (result traversal);
                                                                                                                                                                                                                                                                                                                                                                                                                                                              result                                                                                                                                                                                                                                                                                                                                                                                                                                                              
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 844424930131969, "label": "begin", "properties": {}}]
(1 row)

-- Each should return 3
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[e*0..1]->(v) RETURN id(u), e, id(v) $$) AS (u gtype, e variable_edge, v gtype);
        u        |                                                                            e                                                                             |        v         
-----------------+----------------------------------------------------------------------------------------------------------------------------------------------------------+------------------
 844424930131969 | [{"id": 2251799813685249, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "alternate_edge", "properties": {"name": "alternate edge"}}] | 1407374883553281
 844424930131969 | [{"id": 1125899906842628, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "edge", "properties": {"name": "main edge"}}]                | 1407374883553281
(2 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)-[e*0..1]->(v) RETURN p $$) AS (p traversal);
                                                                                                                                          p                                                                                                                                           
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2251799813685249, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 1125899906842628, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}]
(2 rows)

-- Each should return 5
SELECT * FROM cypher('cypher_vle', $$MATCH (u)-[e*0..0]->(v) RETURN id(u), e, id(v) $$) AS (u gtype, e variable_edge, v gtype);
 u | e | v 
---+---+---
(0 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(u)-[e*0..0]->(v) RETURN id(u), p, id(v) $$) AS (u gtype, p traversal, v gtype);
 u | p | v 
---+---+---
(0 rows)

-- Each should return 13 and will be the same
SELECT * FROM cypher('cypher_vle', $$MATCH p=()-[*0..0]->()-[]->() RETURN p $$) AS (p traversal);
 p 
---
(0 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=()-[]->()-[*0..0]->() RETURN p $$) AS (p traversal);
 p 
---
(0 rows)

SELECT count(*) FROM cypher('cypher_vle', $$MATCH (u)-[*]-(v) RETURN u, v$$) AS (u vertex, v vertex);
 count  
--------
 369262
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$MATCH (u)-[*0..1]-(v) RETURN u, v$$) AS (u vertex, v vertex);
 count 
-------
    24
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$MATCH (u)-[*..1]-(v) RETURN u, v$$) AS (u vertex, v vertex);
 count 
-------
    24
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$MATCH (u)-[*..5]-(v) RETURN u, v$$) AS (u vertex, v vertex);
 count 
-------
  5450
(1 row)

--
-- Test VLE inside of a BEGIN/COMMIT block
--
BEGIN;
SELECT create_graph('mygraph');
NOTICE:  graph "mygraph" has been created
 create_graph 
--------------
 
(1 row)

--should create 1 path with 1 edge
SELECT * FROM cypher('mygraph', $$
    CREATE (a:Node {name: 'a'})-[:Edge]->(c:Node {name: 'c'})
$$) AS (g1 gtype);
 g1 
----
(0 rows)

--  should return 1 path with 1 edge
SELECT * FROM cypher('mygraph', $$
    MATCH  p=(a)-[e:Edge*]->(b)
    RETURN p
$$) AS (e traversal);
                                                                                                                                  e                                                                                                                                  
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "Node", "properties": {"name": "a"}}, {"id": 1125899906842625, "start_id": 844424930131969, "end_id": 844424930131970, "label": "Edge", "properties": {}}, {"id": 844424930131970, "label": "Node", "properties": {"name": "c"}}]
(1 row)

-- should delete the original path and replace it with a path with 2 edges
SELECT * FROM cypher('mygraph', $$
    MATCH (a:Node {name: 'a'})-[e:Edge]->(c:Node {name: 'c'})
    DELETE e
    CREATE (a)-[:Edge]->(:Node {name: 'b'})-[:Edge]->(c)
$$) AS (g3 gtype);
 g3 
----
(0 rows)

-- should find 2 paths with 1 edge
SELECT * FROM cypher('mygraph', $$
    MATCH p = ()-[:Edge]->()
    RETURN p
$$) AS (g4 traversal);
                                                                                                                                 g4                                                                                                                                  
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131971, "label": "Node", "properties": {"name": "b"}}, {"id": 1125899906842626, "start_id": 844424930131971, "end_id": 844424930131970, "label": "Edge", "properties": {}}, {"id": 844424930131970, "label": "Node", "properties": {"name": "c"}}]
 [{"id": 844424930131969, "label": "Node", "properties": {"name": "a"}}, {"id": 1125899906842627, "start_id": 844424930131969, "end_id": 844424930131971, "label": "Edge", "properties": {}}, {"id": 844424930131971, "label": "Node", "properties": {"name": "b"}}]
(2 rows)

-- should return 3 paths, 2 with 1 edge, 1 with 2 edges
SELECT * FROM cypher('mygraph', $$
    MATCH p = ()-[:Edge*]->()
    RETURN p
$$) AS (g5 traversal);
                                                                                                                                                                                                                               g5                                                                                                                                                                                                                                
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "Node", "properties": {"name": "a"}}, {"id": 1125899906842627, "start_id": 844424930131969, "end_id": 844424930131971, "label": "Edge", "properties": {}}, {"id": 844424930131971, "label": "Node", "properties": {"name": "b"}}, {"id": 1125899906842626, "start_id": 844424930131971, "end_id": 844424930131970, "label": "Edge", "properties": {}}, {"id": 844424930131970, "label": "Node", "properties": {"name": "c"}}]
 [{"id": 844424930131971, "label": "Node", "properties": {"name": "b"}}, {"id": 1125899906842626, "start_id": 844424930131971, "end_id": 844424930131970, "label": "Edge", "properties": {}}, {"id": 844424930131970, "label": "Node", "properties": {"name": "c"}}]
 [{"id": 844424930131969, "label": "Node", "properties": {"name": "a"}}, {"id": 1125899906842627, "start_id": 844424930131969, "end_id": 844424930131971, "label": "Edge", "properties": {}}, {"id": 844424930131971, "label": "Node", "properties": {"name": "b"}}]
(3 rows)

SELECT drop_graph('mygraph', true);
NOTICE:  drop cascades to 4 other objects
DETAIL:  drop cascades to table mygraph._ag_label_vertex
drop cascades to table mygraph._ag_label_edge
drop cascades to table mygraph."Node"
drop cascades to table mygraph."Edge"
NOTICE:  graph "mygraph" has been dropped
 drop_graph 
------------
 
(1 row)

COMMIT;
--
-- Test VLE inside procedures
--
SELECT create_graph('mygraph');
NOTICE:  graph "mygraph" has been created
 create_graph 
--------------
 
(1 row)

SELECT create_vlabel('mygraph', 'head');
NOTICE:  VLabel "head" has been created
 create_vlabel 
---------------
 
(1 row)

SELECT create_vlabel('mygraph', 'tail');
NOTICE:  VLabel "tail" has been created
 create_vlabel 
---------------
 
(1 row)

SELECT create_vlabel('mygraph', 'node');
NOTICE:  VLabel "node" has been created
 create_vlabel 
---------------
 
(1 row)

SELECT create_elabel('mygraph', 'next');
NOTICE:  ELabel "next" has been created
 create_elabel 
---------------
 
(1 row)

CREATE OR REPLACE FUNCTION create_list(list_name text)
RETURNS void
LANGUAGE 'plpgsql'
AS $$
DECLARE
    ag_param gtype;
BEGIN
    ag_param = FORMAT('{"list_name": %s}', $1::gtype);
    PERFORM * FROM cypher('mygraph', $CYPHER$
        MERGE (:head {name: $list_name})-[:next]->(:tail {name: $list_name})
    $CYPHER$, ag_param) AS (a gtype);
END $$;
CREATE OR REPLACE FUNCTION prepend_node(list_name text, node_content text)
RETURNS void
LANGUAGE 'plpgsql'
AS $$
DECLARE
    ag_param gtype;
BEGIN
    ag_param = FORMAT('{"list_name": %s, "node_content": %s}', $1::gtype, $2::gtype);
    PERFORM * FROM cypher('mygraph', $CYPHER$
        MATCH (h:head {name: $list_name})-[e:next]->(v)
        DELETE e
        CREATE (h)-[:next]->(:node {content: $node_content})-[:next]->(v)
    $CYPHER$, ag_param) AS (a gtype);
END $$;
CREATE OR REPLACE FUNCTION show_list_use_vle(list_name text)
RETURNS TABLE(node gtype)
LANGUAGE 'plpgsql'
AS $$
DECLARE
    ag_param gtype;
BEGIN
    ag_param = FORMAT('{"list_name": %s}', $1::gtype);
    RETURN QUERY
    SELECT * FROM cypher('mygraph', $CYPHER$
        MATCH (h:head {name: $list_name})-[e:next*]->(v:node)
        RETURN v
    $CYPHER$, ag_param) AS (node gtype);
END $$;
-- create a list
SELECT create_list('list01');
 create_list 
-------------
 
(1 row)

-- prepend a node 'a'
-- should find 1 row
SELECT prepend_node('list01', 'a');
 prepend_node 
--------------
 
(1 row)

SELECT * FROM show_list_use_vle('list01');
ERROR:  cannot cast type vertex to gtype for column "node"
LINE 1: SELECT * FROM cypher('mygraph', $CYPHER$
                      ^
QUERY:  SELECT * FROM cypher('mygraph', $CYPHER$
        MATCH (h:head {name: $list_name})-[e:next*]->(v:node)
        RETURN v
    $CYPHER$, ag_param) AS (node gtype)
CONTEXT:  PL/pgSQL function show_list_use_vle(text) line 6 at RETURN QUERY
-- prepend a node 'b'
-- should find 2 rows
SELECT prepend_node('list01', 'b');
 prepend_node 
--------------
 
(1 row)

SELECT * FROM show_list_use_vle('list01');
ERROR:  cannot cast type vertex to gtype for column "node"
LINE 1: SELECT * FROM cypher('mygraph', $CYPHER$
                      ^
QUERY:  SELECT * FROM cypher('mygraph', $CYPHER$
        MATCH (h:head {name: $list_name})-[e:next*]->(v:node)
        RETURN v
    $CYPHER$, ag_param) AS (node gtype)
CONTEXT:  PL/pgSQL function show_list_use_vle(text) line 6 at RETURN QUERY
-- prepend a node 'c'
-- should find 3 rows
SELECT prepend_node('list01', 'c');
 prepend_node 
--------------
 
(1 row)

SELECT * FROM show_list_use_vle('list01');
ERROR:  cannot cast type vertex to gtype for column "node"
LINE 1: SELECT * FROM cypher('mygraph', $CYPHER$
                      ^
QUERY:  SELECT * FROM cypher('mygraph', $CYPHER$
        MATCH (h:head {name: $list_name})-[e:next*]->(v:node)
        RETURN v
    $CYPHER$, ag_param) AS (node gtype)
CONTEXT:  PL/pgSQL function show_list_use_vle(text) line 6 at RETURN QUERY
--
-- Clean up
--
DROP FUNCTION show_list_use_vle;
SELECT drop_graph('mygraph', true);
NOTICE:  drop cascades to 6 other objects
DETAIL:  drop cascades to table mygraph._ag_label_vertex
drop cascades to table mygraph._ag_label_edge
drop cascades to table mygraph.head
drop cascades to table mygraph.tail
drop cascades to table mygraph.node
drop cascades to table mygraph.next
NOTICE:  graph "mygraph" has been dropped
 drop_graph 
------------
 
(1 row)

DROP TABLE start_and_end_points;
SELECT drop_graph('cypher_vle', true);
NOTICE:  drop cascades to 9 other objects
DETAIL:  drop cascades to table cypher_vle._ag_label_vertex
drop cascades to table cypher_vle._ag_label_edge
drop cascades to table cypher_vle.begin
drop cascades to table cypher_vle.edge
drop cascades to table cypher_vle.middle
drop cascades to table cypher_vle."end"
drop cascades to table cypher_vle.self_loop
drop cascades to table cypher_vle.alternate_edge
drop cascades to table cypher_vle.bypass_edge
NOTICE:  graph "cypher_vle" has been dropped
 drop_graph 
------------
 
(1 row)

--
-- End
--
