/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
LOAD 'postgraph';
SET search_path TO postgraph;
SELECT create_graph('cypher_with');
NOTICE:  graph "cypher_with" has been created
 create_graph 
--------------
 
(1 row)

SELECT * FROM cypher('cypher_with', $$
WITH true AS b
RETURN b
$$) AS (b bool);
 b 
---
 t
(1 row)

-- Expression item must be aliased.
SELECT * FROM cypher('cypher_with', $$
WITH 1 + 1
RETURN i
$$) AS (i int);
ERROR:  expression item must be aliased
LINE 2: WITH 1 + 1
             ^
HINT:  Items can be aliased by using AS.
SELECT * FROM cypher('cypher_with', $$
    CREATE ({i: 1}), ({i: 1, j: 2}), ({i: 2})
$$) as (a gtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_with', $$
    MATCH (n)
    WITH n as a WHERE n.i = 1
    RETURN a
$$) as (n vertex);
                                  n                                   
----------------------------------------------------------------------
 {"id": 281474976710657, "label": "", "properties": {"i": 1}}
 {"id": 281474976710658, "label": "", "properties": {"i": 1, "j": 2}}
(2 rows)

SELECT * FROM cypher('cypher_with', $$
    MATCH (n)
    WITH n as a WHERE n.i = 1 and n.j = 2
    RETURN a
$$) as (n vertex);
                                  n                                   
----------------------------------------------------------------------
 {"id": 281474976710658, "label": "", "properties": {"i": 1, "j": 2}}
(1 row)

SELECT drop_graph('cypher_with', true);
NOTICE:  drop cascades to 2 other objects
DETAIL:  drop cascades to table cypher_with._ag_label_vertex
drop cascades to table cypher_with._ag_label_edge
NOTICE:  graph "cypher_with" has been dropped
 drop_graph 
------------
 
(1 row)

