/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
LOAD 'postgraph';
SET search_path TO postgraph;
SELECT create_graph('cypher_vle');
NOTICE:  graph "cypher_vle" has been created
 create_graph 
--------------
 
(1 row)

--
-- Create table to hold the start and end vertices to test the SRF
--
CREATE TABLE start_and_end_points (start_vertex vertex, end_vertex vertex);
-- Create a graph to test
SELECT * FROM cypher('cypher_vle', $$
	CREATE (b:begin)-[:edge {name: 'main edge'}]->(u1:middle)-[:edge {name: 'main edge'}]->(u2:middle)-[:edge {name: 'main edge'}]->(u3:middle)-[:edge {name: 'main edge'}]->(e:end),
	(u1)-[:self_loop {name: 'self loop'}]->(u1),
	(e)-[:self_loop {name: 'self loop'}]->(e),
	(b)-[:alternate_edge {name: 'alternate edge'}]->(u1),
	(u2)-[:alternate_edge {name: 'alternate edge'}]->(u3),
	(u3)-[:alternate_edge {name: 'alternate edge'}]->(e),
	(u2)-[:bypass_edge {name: 'bypass edge'}]->(e),
	(e)-[:alternate_edge {name: 'backup edge'}]->(u3), 
	(u3)-[:alternate_edge {name: 'backup edge'}]->(u2),
	(u2)-[:bypass_edge {name: 'bypass edge'}]->(b)
	RETURN b, e
$$) AS (b vertex, e vertex);
                              b                              |                             e                              
-------------------------------------------------------------+------------------------------------------------------------
 {"id": 844424930131969, "label": "begin", "properties": {}} | {"id": 1688849860263937, "label": "end", "properties": {}}
(1 row)

-- Insert start and end points for graph
INSERT INTO start_and_end_points 
SELECT * FROM cypher('cypher_vle', $$
	MATCH (b:begin)-[:edge]->()-[:edge]->()-[:edge]->()-[:edge]->(e:end)
	RETURN b, e
$$) AS (b vertex, e vertex);
-- Display our points
SELECT * FROM start_and_end_points;
                        start_vertex                         |                         end_vertex                         
-------------------------------------------------------------+------------------------------------------------------------
 {"id": 844424930131969, "label": "begin", "properties": {}} | {"id": 1688849860263937, "label": "end", "properties": {}}
(1 row)

SELECT edges
FROM start_and_end_points,
     vle(
	'"cypher_vle"'::gtype,
	start_vertex, end_vertex,
	'3'::gtype,
	'3'::gtype,
	'-1'::gtype);
ERROR:  function vle(gtype, vertex, vertex, gtype, gtype, gtype) does not exist
LINE 3:      vle(
             ^
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.
-- Count the total paths from left (start) to right (end) -[]-> should be 400
SELECT count(edges) FROM start_and_end_points, vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '1'::gtype, 'null'::gtype, '1'::gtype, NULL, NULL);
 count 
-------
 400
(1 row)

-- Count the total paths from right (end) to left (start) <-[]- should be 2
SELECT count(edges) FROM start_and_end_points, vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '1'::gtype, 'null'::gtype, '-1'::gtype, NULL, NULL);
 count 
-------
 2
(1 row)

-- Count the total paths undirectional -[]- should be 7092
SELECT count(edges) FROM start_and_end_points, vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '1'::gtype, 'null'::gtype, '0'::gtype, NULL, NULL);
 count 
-------
 7092
(1 row)

-- All paths of length 3 -[]-> should be 2
SELECT count(edges) FROM start_and_end_points, vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '3'::gtype, '3'::gtype, '1'::gtype, NULL, NULL);
 count 
-------
 2
(1 row)

-- All paths of length 3 <-[]- should be 1
SELECT count(edges) FROM start_and_end_points, vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '3'::gtype, '3'::gtype, '-1'::gtype, NULL, NULL);
 count 
-------
 1
(1 row)

-- All paths of length 3 -[]- should be 12
SELECT count(edges) FROM start_and_end_points, vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '3'::gtype, '3'::gtype, '0'::gtype, NULL, NULL);
 count 
-------
 12
(1 row)

-- Test edge label matching - should match 1
SELECT count(edges) FROM start_and_end_points, vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '1'::gtype, 'null'::gtype, '1'::gtype, '"edge"'::gtype, NULL);
 count 
-------
 1
(1 row)

-- Test scalar property matching - should match 1
SELECT count(edges) FROM start_and_end_points, vle( '"cypher_vle"'::gtype, start_vertex, end_vertex, '1'::gtype, 'null'::gtype, '1'::gtype, NULL::gtype, '{"name": "main edge"}'::gtype);
 count 
-------
 1
(1 row)

-- Test the VLE match integration
-- Each should find 400
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*..]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*0..]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*1..]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*1..200]->(v:end) RETURN count(*) $$) AS (e gtype);
  e  
-----
 400
(1 row)

-- Each should find 2
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*..]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*0..]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*1..]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[*1..200]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 2
(1 row)

-- Each should find 7092
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*..]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*0..]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*1..]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[*1..200]-(v:end) RETURN count(*) $$) AS (e gtype);
  e   
------
 7092
(1 row)

-- Each should find 1
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[:edge*]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[:edge* {name: "main edge"}]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[* {name: "main edge"}]-(v:end) RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

-- Each should find 1
SELECT * FROM cypher('cypher_vle', $$MATCH ()<-[*4..4 {name: "main edge"}]-() RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u)<-[*4..4 {name: "main edge"}]-() RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH ()<-[*4..4 {name: "main edge"}]-(v) RETURN count(*) $$) AS (e gtype);
 e 
---
 1
(1 row)

-- Each should find 2922
SELECT * FROM cypher('cypher_vle', $$MATCH ()-[*]->() RETURN count(*) $$) AS (e gtype);
  e   
------
 2922
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH (u)-[*]->() RETURN count(*) $$) AS (e gtype);
  e   
------
 2922
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH ()-[*]->(v) RETURN count(*) $$) AS (e gtype);
  e   
------
 2922
(1 row)

-- Should find 2
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)<-[e*]-(v:end) RETURN e $$) AS (e variable_edge);
                                                                                                                                                                                                                                                                                                                                                                                                    e                                                                                                                                                                                                                                                                                                                                                                                                    
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}]
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}]
(2 rows)

-- Should find 5
SELECT * FROM cypher('cypher_vle', $$MATCH p=(:begin)<-[*1..1]-()-[]-() RETURN p ORDER BY p $$) AS (e traversal);
                                                                                                                                                                                                                                                   e                                                                                                                                                                                                                                                    
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842626, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685250, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(5 rows)

-- Should find 2922
SELECT * FROM cypher('cypher_vle', $$MATCH p=()-[*]->(v) RETURN count(*) $$) AS (e gtype);
  e   
------
 2922
(1 row)

-- Should find 2
SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)-[*3..3]->(v:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                      e                                                                                                                                                                                                                                                                                                                                                       
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2251799813685249, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 1125899906842628, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(2 rows)

-- Should find 12
SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)-[*3..3]-(v:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                              e                                                                                                                                                                                                                                                                                                                                                              
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685251, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 1125899906842625, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685250, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685250, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685251, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685250, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842625, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842626, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842626, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685251, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842626, "start_id": 1407374883553282, "end_id": 1407374883553283, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 1125899906842625, "start_id": 1407374883553283, "end_id": 1688849860263937, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2251799813685249, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 1125899906842628, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 1125899906842627, "start_id": 1407374883553281, "end_id": 1407374883553282, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}, {"id": 2533274790395905, "start_id": 1407374883553282, "end_id": 1688849860263937, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(12 rows)

-- Each should find 2
SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)<-[*]-(v:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                                                                                                                                e                                                                                                                                                                                                                                                                                                                                                                                                                                                                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(2 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)<-[e*]-(v:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                                                                                                                                e                                                                                                                                                                                                                                                                                                                                                                                                                                                                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(2 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)<-[e*]-(v:end) RETURN e $$) AS (e variable_edge);
                                                                                                                                                                                                                                                                                                                                                                                                    e                                                                                                                                                                                                                                                                                                                                                                                                    
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}]
 [{"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}]
(2 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(:begin)<-[*]-()<-[]-(:end) RETURN p $$) AS (e traversal);
                                                                                                                                                                                                                                                                                                                                                                                                                                                                e                                                                                                                                                                                                                                                                                                                                                                                                                                                                 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 1407374883553282, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}]
(2 rows)

-- Each should return 31
SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1]->(v)-[e2]->() RETURN e1,e2 $$) AS (e1 edge, e2 edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1*1..1]->(v)-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 variable_edge, e2 variable_edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH (v)-[e1*1..1]->()-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 variable_edge, e2 variable_edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1]->(v)-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 edge, e2 variable_edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1]->()-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 edge, e2 variable_edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1*1..1]->(v)-[e2]->() RETURN e1, e2
$$) AS (e1 variable_edge, e2 edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH ()-[e1*1..1]->()-[e2]->() RETURN e1, e2 $$) AS (e1 variable_edge, e2 edge);
 count 
-------
    31
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH (a)-[e1]->(a)-[e2*1..1]->() RETURN e1, e2 $$) AS (e1 edge, e2 variable_edge);
 count 
-------
     2
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH (a) MATCH (a)-[e1*1..1]->(v) RETURN e1 $$) AS (e1 variable_edge);
 count 
-------
    13
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$ MATCH (a) MATCH ()-[e1*1..1]->(a) RETURN e1 $$) AS (e1 variable_edge);
 count 
-------
    13
(1 row)

SELECT count(*)
FROM cypher('cypher_vle', $$
    MATCH (a)-[e*1..1]->()
    RETURN a, e
$$) AS (e1 vertex, e2 variable_edge);
 count 
-------
    13
(1 row)

-- Should return 1 path
SELECT * FROM cypher('cypher_vle', $$ MATCH p=()<-[e1*]-(:end)-[e2*]->(:begin) RETURN p $$) AS (result traversal);
                                                                                                                                                                                                                                                                                                                                                                                                                                                              result                                                                                                                                                                                                                                                                                                                                                                                                                                                              
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 1970324836974594, "start_id": 1688849860263937, "end_id": 1688849860263937, "label": "self_loop", "properties": {"name": "self loop"}}, {"id": 1688849860263937, "label": "end", "properties": {}}, {"id": 2251799813685252, "start_id": 1688849860263937, "end_id": 1407374883553283, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2251799813685253, "start_id": 1407374883553283, "end_id": 1407374883553282, "label": "alternate_edge", "properties": {"name": "backup edge"}}, {"id": 1407374883553283, "label": "middle", "properties": {}}, {"id": 2533274790395906, "start_id": 1407374883553282, "end_id": 844424930131969, "label": "bypass_edge", "properties": {"name": "bypass edge"}}, {"id": 844424930131969, "label": "begin", "properties": {}}]
(1 row)

-- Each should return 3
SELECT * FROM cypher('cypher_vle', $$MATCH (u:begin)-[e*0..1]->(v) RETURN id(u), e, id(v) $$) AS (u gtype, e variable_edge, v gtype);
        u        |                                                                            e                                                                             |        v         
-----------------+----------------------------------------------------------------------------------------------------------------------------------------------------------+------------------
 844424930131969 | [{"id": 2251799813685249, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "alternate_edge", "properties": {"name": "alternate edge"}}] | 1407374883553281
 844424930131969 | [{"id": 1125899906842628, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "edge", "properties": {"name": "main edge"}}]                | 1407374883553281
(2 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(u:begin)-[e*0..1]->(v) RETURN p $$) AS (p traversal);
                                                                                                                                          p                                                                                                                                           
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 2251799813685249, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "alternate_edge", "properties": {"name": "alternate edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}]
 [{"id": 844424930131969, "label": "begin", "properties": {}}, {"id": 1125899906842628, "start_id": 844424930131969, "end_id": 1407374883553281, "label": "edge", "properties": {"name": "main edge"}}, {"id": 1407374883553281, "label": "middle", "properties": {}}]
(2 rows)

-- Each should return 5
SELECT * FROM cypher('cypher_vle', $$MATCH (u)-[e*0..0]->(v) RETURN id(u), e, id(v) $$) AS (u gtype, e variable_edge, v gtype);
 u | e | v 
---+---+---
(0 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(u)-[e*0..0]->(v) RETURN id(u), p, id(v) $$) AS (u gtype, p traversal, v gtype);
 u | p | v 
---+---+---
(0 rows)

-- Each should return 13 and will be the same
SELECT * FROM cypher('cypher_vle', $$MATCH p=()-[*0..0]->()-[]->() RETURN p $$) AS (p traversal);
 p 
---
(0 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=()-[]->()-[*0..0]->() RETURN p $$) AS (p traversal);
 p 
---
(0 rows)

SELECT count(*) FROM cypher('cypher_vle', $$MATCH (u)-[*]-(v) RETURN u, v$$) AS (u vertex, v vertex);
 count  
--------
 369262
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$MATCH (u)-[*0..1]-(v) RETURN u, v$$) AS (u vertex, v vertex);
 count 
-------
    24
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$MATCH (u)-[*..1]-(v) RETURN u, v$$) AS (u vertex, v vertex);
 count 
-------
    24
(1 row)

SELECT count(*) FROM cypher('cypher_vle', $$MATCH (u)-[*..5]-(v) RETURN u, v$$) AS (u vertex, v vertex);
 count 
-------
  5450
(1 row)

SELECT * FROM cypher('cypher_vle', $$MATCH p=(:begin)<-[ve1*]-(:end), (:end)-[ve2*]->(:begin) RETURN ve1 && ve2 $$) AS (overlap boolean);
 overlap 
---------
 t
 t
 t
 t
(4 rows)

SELECT * FROM cypher('cypher_vle', $$MATCH p=()<-[ve1:edge*]-(), ()-[ve2:alternate_edge*]->() RETURN ve1 && ve2 $$) AS (overlap boolean);
 overlap 
---------
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
 f
(190 rows)

SELECT * FROM ag_label;
       name       | graph | id | kind |          relation           |          label_path           
------------------+-------+----+------+-----------------------------+-------------------------------
 _ag_label_vertex | 21864 |  1 | v    | cypher_vle._ag_label_vertex | _ag_label_vertex
 _ag_label_edge   | 21864 |  2 | e    | cypher_vle._ag_label_edge   | _ag_label_edge
 begin            | 21864 |  3 | v    | cypher_vle.begin            | _ag_label_vertex.begin
 edge             | 21864 |  4 | e    | cypher_vle.edge             | _ag_label_edge.edge
 middle           | 21864 |  5 | v    | cypher_vle.middle           | _ag_label_vertex.middle
 end              | 21864 |  6 | v    | cypher_vle."end"            | _ag_label_vertex.end
 self_loop        | 21864 |  7 | e    | cypher_vle.self_loop        | _ag_label_edge.self_loop
 alternate_edge   | 21864 |  8 | e    | cypher_vle.alternate_edge   | _ag_label_edge.alternate_edge
 bypass_edge      | 21864 |  9 | e    | cypher_vle.bypass_edge      | _ag_label_edge.bypass_edge
(9 rows)

--
-- Clean up
--
DROP TABLE start_and_end_points;
SELECT drop_graph('cypher_vle', true);
NOTICE:  drop cascades to 9 other objects
DETAIL:  drop cascades to table cypher_vle._ag_label_vertex
drop cascades to table cypher_vle._ag_label_edge
drop cascades to table cypher_vle.begin
drop cascades to table cypher_vle.edge
drop cascades to table cypher_vle.middle
drop cascades to table cypher_vle."end"
drop cascades to table cypher_vle.self_loop
drop cascades to table cypher_vle.alternate_edge
drop cascades to table cypher_vle.bypass_edge
NOTICE:  graph "cypher_vle" has been dropped
 drop_graph 
------------
 
(1 row)

--
-- End
--
