/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
LOAD 'postgraph';
SET search_path TO postgraph;
SELECT create_graph('cypher_unwind');
NOTICE:  graph "cypher_unwind" has been created
 create_graph 
--------------
 
(1 row)

SELECT * FROM cypher('cypher_unwind', $$
    UNWIND [1, 2, 3] AS i RETURN i
$$) as (i gtype);
 i 
---
 1
 2
 3
(3 rows)

SELECT * FROM cypher('cypher_unwind', $$
    CREATE ({a: [1, 2, 3]}), ({a: [4, 5, 6]})
$$) as (i gtype);
 i 
---
(0 rows)

SELECT * FROM cypher('cypher_unwind', $$
    MATCH (n) WITH n.a AS a UNWIND a AS i RETURN *
$$) as (i gtype, j gtype);
     i     | j 
-----------+---
 [1, 2, 3] | 1
 [1, 2, 3] | 2
 [1, 2, 3] | 3
 [4, 5, 6] | 4
 [4, 5, 6] | 5
 [4, 5, 6] | 6
(6 rows)

SELECT * FROM cypher('cypher_unwind', $$
    WITH [[1, 2], [3, 4], 5] AS nested
    UNWIND nested AS x
    UNWIND x AS y
    RETURN y
$$) as (i gtype);
 i 
---
 1
 2
 3
 4
 5
(5 rows)

SELECT * FROM cypher('cypher_unwind', $$
    MATCH (n_1)
    WITH collect(n_1) as n
    UNWIND n as a
    SET a.i = 1
    RETURN a
$$) as (i vertex);
ERROR:  cannot cast type gtype to vertex for column "i"
LINE 1: SELECT * FROM cypher('cypher_unwind', $$
                      ^
SELECT * FROM cypher('cypher_unwind', $$
    MATCH (n_1)
    WITH collect(n_1) as n
    UNWIND n as a
    RETURN a
$$) as (i vertex);
                                  i                                   
----------------------------------------------------------------------
 {"id": 281474976710657, "label": "", "properties": {"a": [1, 2, 3]}}
 {"id": 281474976710658, "label": "", "properties": {"a": [4, 5, 6]}}
(2 rows)

SELECT * FROM cypher('cypher_unwind', $$
    MATCH (n_1)
    WITH collect(n_1) as n
    UNWIND n as a
    RETURN a
$$) as (i gtype);
ERROR:  cannot cast type vertex to gtype for column "i"
LINE 1: SELECT * FROM cypher('cypher_unwind', $$
                      ^
SELECT * FROM cypher('cypher_unwind', $$
    MATCH (n_1)
    WITH collect(n_1) as n
    UNWIND n as a
    SET a.i = 1
    RETURN a
$$) as (i vertex);
ERROR:  cannot cast type gtype to vertex for column "i"
LINE 1: SELECT * FROM cypher('cypher_unwind', $$
                      ^
SELECT * FROM cypher('cypher_unwind', $$
    MATCH (n_1)
    WITH collect(n_1) as n
    UNWIND n as a
    WITH a
    SET a.i = 1
    RETURN a
$$) as (i vertex);
ERROR:  cannot cast type gtype to vertex for column "i"
LINE 1: SELECT * FROM cypher('cypher_unwind', $$
                      ^
SELECT * FROM cypher('cypher_unwind', $$
    MATCH (n_1)
    WITH collect(n_1) as n
    UNWIND n as a
    CREATE ({i: a.i})
    RETURN a
$$) as (i vertex);
                                  i                                   
----------------------------------------------------------------------
 {"id": 281474976710657, "label": "", "properties": {"a": [1, 2, 3]}}
 {"id": 281474976710658, "label": "", "properties": {"a": [4, 5, 6]}}
(2 rows)

SELECT * FROM cypher('cypher_unwind', $$
    CREATE ()-[:e {a: [1, 2, 3]}]->()
$$) as (i gtype);
 i 
---
(0 rows)

SELECT * FROM cypher('cypher_unwind', $$
    CREATE ()-[:e {a: [1, 2, 3]}]->()
$$) as (i gtype);
 i 
---
(0 rows)

SELECT * FROM cypher('cypher_unwind', $$
    MATCH t=()-[:e]->()
    UNWIND relationships(t) as rel
    RETURN rel
$$) as (i edge);
                                                               i                                                               
-------------------------------------------------------------------------------------------------------------------------------
 {"id": 844424930131969, "start_id": 281474976710661, "end_id": 281474976710662, "label": "e", "properties": {"a": [1, 2, 3]}}
 {"id": 844424930131970, "start_id": 281474976710663, "end_id": 281474976710664, "label": "e", "properties": {"a": [1, 2, 3]}}
(2 rows)

SELECT drop_graph('cypher_unwind', true);
NOTICE:  drop cascades to 3 other objects
DETAIL:  drop cascades to table cypher_unwind._ag_label_vertex
drop cascades to table cypher_unwind._ag_label_edge
drop cascades to table cypher_unwind.e
NOTICE:  graph "cypher_unwind" has been dropped
 drop_graph 
------------
 
(1 row)

