/*
 * Copyright (C) 2024 PostGraphDB
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU Affero General Public License as
 * published by the Free Software Foundation, either version 3 of the
 * License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU Affero General Public License for more details.
 *
 * You should have received a copy of the GNU Affero General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */ 
-- Regression tests don't preload extensions, gotta load it first
LOAD 'postgraph';
CREATE EXTENSION postgraph;
ERROR:  extension "postgraph" already exists
CREATE EXTENSION hstore;
CREATE EXTENSION IF NOT EXISTS hstore;
NOTICE:  extension "hstore" already exists, skipping
-- Basic Graph creation
CREATE GRAPH new_cypher;
NOTICE:  graph "new_cypher" has been created
 create_graph 
--------------
 
(1 row)

-- Assign Graph to use
USE GRAPH new_cypher;
 use_graph 
-----------
 
(1 row)

-- Reuse Name, should throw error
CREATE GRAPH new_cypher;
ERROR:  graph "new_cypher" already exists
-- Graph Does not exist, should throw error
USE GRAPH new_cypher;
 use_graph 
-----------
 
(1 row)

CREATE GRAPH new_cypher_2;
NOTICE:  graph "new_cypher_2" has been created
 create_graph 
--------------
 
(1 row)

USE GRAPH new_cypher_2;
 use_graph 
-----------
 
(1 row)

USE GRAPH new_cypher;
 use_graph 
-----------
 
(1 row)

-- Old Grammar is at least partially plugged in.
RETURN 1 as a;
 a 
---
 1
(1 row)

CREATE (n);
--
(0 rows)

CREATE (n) RETURN n;
                           n                            
--------------------------------------------------------
 {"id": 281474976710658, "label": "", "properties": {}}
(1 row)

--CREATE (n) RETURN *;
MATCH (n) RETURN n;
                           n                            
--------------------------------------------------------
 {"id": 281474976710657, "label": "", "properties": {}}
 {"id": 281474976710658, "label": "", "properties": {}}
(2 rows)

MATCH (n) RETURN *;
                           n                            
--------------------------------------------------------
 {"id": 281474976710657, "label": "", "properties": {}}
 {"id": 281474976710658, "label": "", "properties": {}}
(2 rows)

DROP GRAPH new_cypher CASCADE;
NOTICE:  drop cascades to 2 other objects
DETAIL:  drop cascades to table new_cypher._ag_label_vertex
drop cascades to table new_cypher._ag_label_edge
NOTICE:  graph "new_cypher" has been dropped
 drop_graph 
------------
 
(1 row)

DROP GRAPH new_cypher_2 CASCADE;
NOTICE:  drop cascades to 2 other objects
DETAIL:  drop cascades to table new_cypher_2._ag_label_vertex
drop cascades to table new_cypher_2._ag_label_edge
NOTICE:  graph "new_cypher_2" has been dropped
 drop_graph 
------------
 
(1 row)

