/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
LOAD 'postgraph';
SET search_path TO postgraph;
SELECT create_graph('regex');
NOTICE:  graph "regex" has been created
 create_graph 
--------------
 
(1 row)

SELECT * FROM cypher('regex', $$ CREATE (n:Person {name: 'John'}) $$) AS r(result gtype);
 result 
--------
(0 rows)

SELECT * FROM cypher('regex', $$ CREATE (n:Person {name: 'Jeff'}) $$) AS r(result gtype);
 result 
--------
(0 rows)

SELECT * FROM cypher('regex', $$ CREATE (n:Person {name: 'Joan'}) $$) AS r(result gtype);
 result 
--------
(0 rows)

--
-- =~ cypher case sensitive regular expression 
--
SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name =~ 'JoHn' RETURN n
$$) AS r(result vertex);
 result 
--------
(0 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name =~ '(?i)JoHn' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
(1 row)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name =~ 'Jo.n' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(2 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name =~ 'J.*' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(3 rows)

--
-- ~ POSIX case sensitive regular expression 
--
SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~ 'JoHn' RETURN n
$$) AS r(result vertex);
 result 
--------
(0 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~ '(?i)JoHn' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
(1 row)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~ 'Jo.n' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(2 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~ 'J.*' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(3 rows)

--
-- ~* POSIX case insensitive regular expression 
--
SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~* 'john' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
(1 row)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~* '(?i)john' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
(1 row)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~* 'jo.n' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(2 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~* 'j.*' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(3 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~* '.*' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(3 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name ~* 'JOHN' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
(1 row)

--
-- !~ POSIX case sensitive regular expression not match
--
SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~ 'john' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(3 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~ '(?i)john' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(2 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~ 'jo.n' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(3 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~ 'j.*' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(3 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~ '.*' RETURN n
$$) AS r(result vertex);
 result 
--------
(0 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~ 'JOHN' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131969, "label": "Person", "properties": {"name": "John"}}
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(3 rows)

--
-- !~* POSIX case sensitive regular expression not match
--
SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~* 'john' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(2 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~* '(?i)john' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(2 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~* 'jo.n' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
(1 row)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~* 'j.*' RETURN n
$$) AS r(result vertex);
 result 
--------
(0 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~* '.*' RETURN n
$$) AS r(result vertex);
 result 
--------
(0 rows)

SELECT * FROM cypher('regex', $$
    MATCH (n:Person) WHERE n.name !~* 'JOHN' RETURN n
$$) AS r(result vertex);
                                   result                                   
----------------------------------------------------------------------------
 {"id": 844424930131970, "label": "Person", "properties": {"name": "Jeff"}}
 {"id": 844424930131971, "label": "Person", "properties": {"name": "Joan"}}
(2 rows)

